[
    {
        "title":"Amnesia The Dark Descent",
        "rating":"5/10",
        "image":"https://i.imgur.com/41jgyvZ.png",
        "review":"Props for being creative here. Amnesia took the horror genre and gave it that surreal feeling while also holding you mentally captive in a mansion with a potato sack monster with claws, that tears your face off. The Jump scare factor was pretty high and almost somewhat reliant for the game to be worth playing, but the suspense was pretty intense almost the whole time you play. The puzzles were a super neat touch as well. Downsides were that all in all it was a pretty short game. The animations were a bit wonky and the ending was pretty disappointing, much like many other horror games, but it wasn't a bad playthrough and I would recommend it if you are into horror, or want to play it for a crowd of people so they can watch you jump at every little movement."
    },    
    {
        "title":"Amnesia: A Machine For Pigs",
        "rating":"10/10",
        "image":"https://i.imgur.com/9aAbtG6.jpg",
        "review":""
    },
    {
        "title":"Amnesia: Rebirth",
        "rating":"7/10",
        "image":"https://i.imgur.com/igBhud2.jpg",
        "review":""
    },
    {
        "title":"Call Of Cthulhu",
        "rating":"7/10",
        "image":"https://i.imgur.com/SLvGAb3.jpg",
        "review":""
    },
    {
        "title":"Misao",
        "rating":"6/10",
        "image":"https://i.imgur.com/gKlBRNH.jpg",
        "review":""
    },
    {
        "title":"Far Cry",
        "rating":"Shitty/10",
        "image":"https://i.imgur.com/eKdDCe5.png",
        "review":""
    },    
    {
        "title":"Far Cry 3",
        "rating":"10/10",
        "image":"https://i.imgur.com/PdptSZG.jpg",
        "review":""
    },
    {
        "title":"Far Cry 3 Blood Dragon",
        "rating":"8/10",
        "image":"https://i.imgur.com/GJhk6XD.jpg",
        "review":""
    },    
    {
        "title":"Far Cry Primal",
        "rating":"5.5/10",
        "image":"https://i.imgur.com/OeCY3nF.jpg",
        "review":""
    },
    {
        "title":"Far Cry 5",
        "rating":"10/10",
        "image":"https://i.imgur.com/qD6OrSk.jpg",
        "review":""
    },
    {
        "title":"Far Cry: New Dawn",
        "rating":"6/10",
        "image":"https://i.imgur.com/p83mc2c.jpg",
        "review":""
    },    
    {
        "title":"Blair Witch",
        "rating":"9.5/10",
        "image":"https://i.imgur.com/RpAstkK.jpg",
        "review":""
    },
    {
        "title":"Super Paper Mario",
        "rating":"6.5/10",
        "image":"https://i.imgur.com/yjQNc0t.jpg",
        "review":""
    },
    {
        "title":"Alan Wake",
        "rating":"9/10",
        "image":"https://i.imgur.com/9Uvz2aY.jpg",
        "review":""
    },
    {
        "title":"Bioshock",
        "rating":"7/10",
        "image":"https://i.imgur.com/WfNK1Fg.jpg",
        "review":""
    },
    {
        "title":"Layers Of Fear",
        "rating":"4/10",
        "image":"https://i.imgur.com/vZygOU7.png",
        "review":""
    },
    {
        "title":"Lucius",
        "rating":"8.5/10",
        "image":"https://i.imgur.com/tfhOKas.png",
        "review":""
    },
    {
        "title":"Undertale",
        "rating":"4.5/10",
        "image":"https://i.imgur.com/gJVm8u9.jpg",
        "review":""
    },
    {
        "title":"Tomb Raider",
        "rating":"6/10",
        "image":"https://i.imgur.com/fcExVtb.jpg",
        "review":""
    },
    {
        "title":"OneShot",
        "rating":"10/10",
        "image":"https://i.imgur.com/v4kMoWs.png",
        "review":""
    },
    {
        "title":"OneShot: Solstice",
        "rating":"7.5/10",
        "image":"https://i.imgur.com/ottCyQ6.jpg",
        "review":""
    },    
    {
        "title":"Celeste",
        "rating":"9/10",
        "image":"https://i.imgur.com/xGBqkcu.jpg",
        "review":""
    },
    {
        "title":"Visage",
        "rating":"9.5/10",
        "image":"https://i.imgur.com/GyjX885.jpg",
        "review":""
    },
    {
        "title":"The Cat Lady",
        "rating":"8/10",
        "image":"https://i.imgur.com/hiZRvpb.jpg",
        "review":""
    },    
    {
        "title":"Downfall",
        "rating":"7.5/10",
        "image":"https://i.imgur.com/6WYKFUu.png",
        "review":""
    },
    {
        "title":"Lorelai",
        "rating":"8.5/10",
        "image":"https://i.imgur.com/icaBXs6.jpg",
        "review":""
    },    
    {
        "title":"Devil May Cry 1",
        "rating":"6/10",
        "image":"https://i.imgur.com/evpFIiJ.jpg",
        "review":""
    },
    {
        "title":"Devil May Cry 2",
        "rating":"3/10",
        "image":"https://i.imgur.com/zZCImfw.jpg",
        "review":""
    },
    {
        "title":"Devil May Cry 3",
        "rating":"5.5/10",
        "image":"https://i.imgur.com/NaJTVqt.jpg",
        "review":""
    },   
    {
        "title":"Devil May Cry 4",
        "rating":"7.5/10",
        "image":"https://i.imgur.com/QRJDsNy.jpg",
        "review":""
    },
    {
        "title":"DmC Devil May Cry",
        "rating":"9/10",
        "image":"https://i.imgur.com/J0c4ngc.png",
        "review":"Charisma? Oh you mean DmC. Absolute bombshell of a game. Graphics were on point, the combat was amazing, it was challenging to a point that you forgot you were in a storyline, grind out a boss for like 45 minutes, beat him, lower your heart’s bpm from 800, and carry on the story, and the flash backs to the backstory was incredible to watch. The weapon switching was a really nice touch, including the tether, axe and scythe mechanics, and how they worked together to a degree. I fell in love with this game almost immediately, and I’m kind of disappointed that I played it first in the series, not knowing that the order actually mattered. Still a fantastic game, though. I couldn’t quite call it perfect, due to some bugs/crashing/render issues etc. so I think the strong 9/10 holds its ground."
    },
    {
        "title":"Strider",
        "rating":"4.5/10",
        "image":"https://i.imgur.com/rLGDbGy.jpg",
        "review":""
    },
    {
        "title":"To The Moon",
        "rating":"8.5/10",
        "image":"https://i.imgur.com/mKp4uRT.jpg",
        "review":""
    },
    {
        "title":"Ori And The Blind Forest",
        "rating":"10/10",
        "image":"https://i.imgur.com/GPRps0C.jpg",
        "review":""
    },
    {
        "title":"Portal",
        "rating":"6/10",
        "image":"https://i.imgur.com/lTF44D3.jpg",
        "review":""
    },
    {
        "title":"Portal 2",
        "rating":"10/10",
        "image":"https://i.imgur.com/0PHN9Ob.jpg",
        "review":""
    },
    {
        "title":"Dead Space",
        "rating":"8.5/10",
        "image":"https://i.imgur.com/sBrJ2Ww.jpg",
        "review":""
    },
    {
        "title":"Dead Space 2",
        "rating":"7.5/10",
        "image":"https://i.imgur.com/jWzZ68e.jpg",
        "review":""
    },
    {
        "title":"Resident Evil 7",
        "rating":"7/10",
        "image":"https://i.imgur.com/fBRI5nJ.jpg",
        "review":""
    },
    {
        "title":"Mad Father",
        "rating":"9/10",
        "image":"https://i.imgur.com/Z1TyXZm.jpg",
        "review":""
    },
    {
        "title":"The Crooked Man",
        "rating":"8/10",
        "image":"https://i.imgur.com/EQFNExB.jpg",
        "review":""
    },
    {
        "title":"Ib",
        "rating":"7/10",
        "image":"https://i.imgur.com/Xa6LuTQ.jpg",
        "review":"This was actually a blast! I really liked playing through this game and I had a lot of fun doing it. Granted, the graphics were all RPG maker, that didn't stop the story or the spooky vibe from emanating full force through this game. Being in a museum at night, on its own, sounds scary. Adding the elements that this character finds and comes across, would make it an absolute nightmare. The puzzles were incredibly intuitive, and make the game challenging, but without stopping the flow and progression of the game. Super SUPER fun to play through and I would do it again in a heartbeat. I guess the reason that I didn't give it a higher score was the pacing, the graphics (albeit it doesn't take good graphics to make a good game, but it definitely helps) and the fact that I feel like it might have dragged a bit of ass coming to the ending, that waaaasn't all that interesting, and a little cliché. That aside, it was incredibly fun and I look forward to playing it for a second time."
    },
    {
        "title":"Outlast",
        "rating":"8/10",
        "image":"https://i.imgur.com/QQac0kh.jpg",
        "review":"Imagine you are in an asylum. Now imagine in said asylum, all the patients were abused and forced to go through medical testing that was completely involuntary. How would you feel being in the middle of that? This game captures that and adds suspense and horror to something that is already scary. Running through this place that has a million and one hiding spots and all you have is a camera to record all of the things that are going on, with no way to retaliate or fight back. Giants with long chains wrapped around their body chasing you around, skinny zombie-like creatures in the sewers that their soul purpose is to take you down. Everything in this game makes you think twice about everything you do. “Will this door trigger something?”, “Is there someone waiting to jump me in the next room?” and keeps you on your toes the entire game. I really enjoyed the aesthetic of the game, as well. Something about that kind of setting is really unsettling especially when you are totally unarmed. I think it’s only downfall was the ending, really. I have been told though that the DLC is what wraps it all together and ends the story better. I mean I get that, but at the same time, it shouldn't take a DLC or a “Second try” to make up for the ending. All in all though, pound for pound this game is a classic, and chances are, people will be playing it for a long time."
    },    
    {
        "title":"Outlast 2",
        "rating":"2/10",
        "image":"https://i.imgur.com/9hPuS5G.jpg",
        "review":"If I said that this game had any redeeming qualities, I would be lying straight to your face, and that's not what I'm all about. This game was absolutely horrendous. Literally the worst horror game I've ever played. Lack of depth, lack of character development, and I feel like the whole game's story line was written by 4 separate people that had never read the other people's scripts. All in all the ONLY thing that I can say was good, were the graphics and the design for the spooky characters. That. Was. It. Nothing else about this game was good, even remotely. I do NOT recommend this game, unless you want to waste 3 hours and you want to try and follow several different paths of a story line that don't lead anywhere."
    },
    {
        "title":"IMSCARED",
        "rating":"6/10",
        "image":"https://i.imgur.com/Z9kgsw4.jpg",
        "review":" It has been a while since I've played this game, but from I remember of it, it had a creepy, old-school vibe about it. The puzzles were interesting, and the graphics/visuals were actually pretty nice compared to some games that I've played. It was interesting, but what really took me out of the immersion was the voice acting. Incredibly loud voiceovers that sounded like they were recorded in the bathroom of a tiny airplane during a thunderstorm. That being said, the game played well, it had cool concepts and ideas, but I wouldn't play it again, strictly because of the voice work."
    },
    {
        "title":"SOMA",
        "rating":"9.5/10",
        "image":"https://i.imgur.com/FrNngBY.jpg",
        "review":"Terrifying. The underwater atmosphere, and the sense of being totally trapped and isolated is something I never want to feel again. That being said, this game did an astounding job at capturing that feeling. Whether it be while you're walking on the ocean floor, watching big shadowy sea creatures pass by, or just being trapped in what can only be described as a tuna can stuffed with alien looking creatures at the bottom of the ocean. Incredible game, incredible atmosphere, and the only downside to it was the ending was a bit of a letdown. Don't let that be the deciding factor on whether or not you play it though. It's worth it overall."
    },
    {
        "title":"Mark After Dark",
        "rating":"9/10",
        "image":"https://i.imgur.com/ufsIadG.png",
        "review":"Although I don't think I made it all the way through this game, this is what I feel an accurate representation of Mark's life would play like. Knowing the main character in real life, I can vouch for this game and say that there are a lot of small things that it picked up, and executed VERY well."
    },
    {
        "title":"Blank Dream",
        "rating":"9/10",
        "image":"https://i.imgur.com/TUH7Xac.jpg",
        "review":"This is an incredible use of the RPG maker template. The graphics were well used, and the story line was in-depth and actually had substance. The use of mirrors throughout the game actually gave you a sense of immersion, almost as if you WERE the character, and you were looking into your own reflection when you stood in front of them. The story line itself was absolutely incredible and actually felt good to complete. The reason I gave it such a high score is because the game played so well. The jump scares were good, the music fit the scenery, and ultimately the whole game had a really sweet message to take away from it at the end. I would happily play this again."
    },
    {
        "title":"Desert Ride Coaster",
        "rating":"Vomit/10",
        "image":"https://i.imgur.com/p532K8L.jpg",
        "review":"45 seconds of nauseating movements and that stomach flipping feeling that you get while you are on a roller coaster. You can hit the “GO” button as many times as you want, but about halfway through I had to take it off because I was legitimately going to vomit. Highly recommend to people that hate themselves, or just enjoy puking."
    },
     {
        "title":"The Visitor",
        "rating":"Spooky/10",
        "image":"https://i.imgur.com/djXd1Bi.jpg",
         "review":"The game was a dollar for a reason. You don’t move, you lay in bed and spooky creatures jump out at you and make the lights flicker. Kind of a fun VR experience, and for the money, you get a couple jumps out of it."
    },
    {
        "title":"Rick and Morty Virtual Rickality",
        "rating":"8/10",
        "image":"https://i.imgur.com/V03sLQm.jpg",
        "review":"This game was a riot. You feel like you are actually in Rick’s garage. From playing Troy, to doing the laundry, it is an experience in itself. Getting to be face to face with Rick and Morty, playing with the gadgets rick has created, feeding the monster under the floor (great object permanence btw) and basically doing meaningless garbage for rick is somehow fun, not sarcastically. I would recommend this game to anyone that fits 2 categories. “Has a VR headset” and “Likes Rick and Morty”. Couldn’t give it a 10 though, due to how short the game itself was. I want it to be at least like.. A few hours? Maybe more? I think in all it took me like 2 hours, taking in the scenery and fumbling around. If you were to have seen the game played, then played it yourself, you would beat it in 45 minutes tops. Good game overall though. Well deserved rating."
    },
    {
        "title":"Paranormal Activity: The Lost Soul",
        "rating":"5/10",
        "image":"https://i.imgur.com/R58D7tx.jpg",
        "review":"PA:LTS played into the biggest thing it could. Immersing you into this terrifying hellscape of a mansion. Walk up to a house and carnage ensues. Children scare you, paintings scare you, book shelves scare you, literally nothing is safe. I think I was scared by a candle at one point. The “story” is kind of all over the place, but at the same time I feel that it’s main goal was to just scare the Jesus into you. Yes, into you. Floors falling away, giant smoke creatures, hidden entrances, this game has it all. The reason it got the rating it did, is because it had no real depth. It  was just trying (and succeeding) to be scary, but not much else. Collect items, avoid monsters, get scared, cry, and get to the end. At the end of the game I didn't feel like I accomplished much, and that I just ran through a house getting scared. I’d recommend this to family and friends, as long as I could watch them play it."
    },
    {
        "title":"South Park The Stick Of Truth",
        "rating":"6.5/10",
        "image":"https://i.imgur.com/l3oJftR.jpg",
        "review":"Absolute hilarity. This game was clever, immature, disturbing, offensive, and extremely fun. Exactly what you would expect from the creators and writers of South Park. They find a way to make extremely touchy subjects (abortion, Nazis, racism) into somehow palatable commercial comedy. It's full of references from the shows, which was incredibly neat to see, and being able to interact with characters you know and love from the show is a really cool feeling, having watched the show since I was young. The combat style is very RPG based and it’s incredibly creative when it comes to abilities. Using farts as attacks is something literally only this game could get away with. Fun game, but get ready for about 25-30 hours of gameplay. Pretty long and unfortunately can't finish it in one sitting, unless you're a machine."
    },
     {
        "title":"The Witch's House",
        "rating":"6/10",
        "image":"https://i.imgur.com/tcWe4oN.jpg",
         "review":"RPG maker games aren't typically the best at telling a story, but this one had a really nice tone to it. Pretty generic type story, but the puzzles and characters were pretty loveable. The multiple endings were very neat also. The “good” or alternate ending is incredibly mind blowing. It explains the story SO well, as well as warping your mindset of every RPG game you play afterwards. Without giving anything away, not everything is how it seems. If you play this game, I highly recommend playing all of the endings. Just make sure you save before the last chunk of the game, in a save slot that you won't accidentally save over it!"
    },
    {
        "title":"Spooky's Jump Scare Mansion",
        "rating":"5/10",
        "image":"https://i.imgur.com/RaaAeMf.png",
        "review":"Well the game stayed true to its name. Jumpscares, randomly generated hallways, bosses that freak you out, the whole 9 yards. Being a 2D game and holding up rating-wise is pretty tough, let alone in the horror genre. It played well and had a lot of good aspects to it. The Easter eggs were a pretty nice touch too. All-in-all it was an okay game. As cool as it was, it got old pretty quick and by room 600 I just wanted the game to be over, which was a huge turn off, almost “expecting” the outcomes of getting to a specific numbered room. “Oh it's room 250, there should be a boss any second now” is not the type of anticipation a horror game should have, nor should it feel like it's dragging out way too long. Fun stream game, though I don't think I'd ever play through it again."
    },
    {
        "title":"Dark Souls",
        "rating":"7.5/10",
        "image":"https://i.imgur.com/wSkxKsx.jpg",
        "review":"So we’re here, hey? Alright. Dark Souls. I died.. sooooo many times. It was incredibly frustrating. All the time. Let me tell you though, the feeling of FINALLY beating those really difficult bosses? That last swing of your sword, watching the boss fall to the ground and the souls going into your inventory/counter is more satisfying than the 1 hour “most satisfying videos in the world” compilations on YouTube. There wasn't a whole ton of story to it, mainly just strategic hack and slash but your highs are high and your lows are so unbelievably low. You just hate everything when you die but that sweet victory sound is so worth it. The ambient sense of “please don't see me” as well as the very pleasing landscapes and structures are such a cool aspect of the game. I'd recommend it to anyone that wouldn't break a controller when they are frustrated."
    },
    {
        "title":"Detention",
        "rating":"7/10",
        "image":"https://i.imgur.com/uGEgVY0.jpg",
        "review":"Boy, this game. MAN this game was good. Side scrolling puzzle filled madness set with a very dark tone. It was incredibly gripping. I didn't want to stop playing the game. You become pretty gripped in the story and invested in the characters. The reason it was given a 7/10 is because of the ending I was given. It didn't close the game out too well in my opinion. Left you hanging a bit, but that is how the game was built and I couldn't knock very many points off for that. There are other endings, and the fact that I was too lazy to replay the game to get a different ending wasn't the game’s fault in all fairness. The art style was incredibly unique though. Kept your attention at all times. Very neat concepts and design to the enemies and puzzles though. Would recommend to anyone who likes puzzle/horror/indie games."
    },
    {
        "title":"Valley",
        "rating":"8/10",
        "image":"https://i.imgur.com/Y2MvxYk.jpg",
        "review":"I absolutely loved this game. The gameplay was literally flawless. The graphics were so aesthetically pleasing. Looking at the landscapes were stunning, the voice acting was VERY suiting to the characters, and the story line did not disappoint. It was very unique in its tasks/quests and it fit the demeanor of the overworld. I really wish this game could have gotten a higher score but it did feel a little bit forced towards the end, and the ending itself left me with a million questions. I REALLY want a second game. I need it to follow up on some key story aspects that I would love to have explained. Good game though, overall. Would recommend to anyone."
    },
    {
        "title":"Tomato Way",
        "rating":"100/10",
        "image":"https://i.imgur.com/DZEbY6C.jpg",
        "review":"Where to even begin? Beautiful graphics, flawless character control, voice acting was incredible, and there's nothing I would change about this game. If you thought this wasn't sarcasm, play the game yourself. Please"
    },
    {
        "title":"Doki Doki Literature Club",
        "rating":"4.5/10",
        "image":"https://i.imgur.com/bDPptCu.png",
        "review":"Doki Doki is a very interesting game. At first, I refused to play it, but ended up with it in my Steam library and made it all the way through. They played on the quirks of anime style dating games and twisted it into a pretty moderate suspense/horror-type genre. I liked the art and music as well as the unexpected nature it had. The reason I gave it the rating that I did was due to it having very long and tedious “down-times”. Meaning that it drug on for way too long without really gripping you. It felt like I should just skip through the dialogue and get to the good stuff” which was a very small portion of the game. I would recommend it to anyone who likes the art style and a few hours to kill, but if that isn't the case, I’d just watch it on YouTube while you doze off to sleep or something."
    }
]
