[{
		"title": "Amnesia The Dark Descent",
		"rating": "5/10",
		"image": "https://i.imgur.com/41jgyvZ.png",
		"review": "Props for being creative here. Amnesia took the horror genre and gave it that surreal feeling while also holding you mentally captive in a mansion with a potato sack monster with claws, that tears your face off. The Jump scare factor was pretty high and almost somewhat reliant for the game to be worth playing, but the suspense was pretty intense almost the whole time you play. The puzzles were a super neat touch as well. Downsides were that all in all it was a pretty short game. The animations were a bit wonky and the ending was pretty disappointing, much like many other horror games, but it wasn't a bad playthrough and I would recommend it if you are into horror, or want to play it for a crowd of people so they can watch you jump at every little movement."
	},
	{
		"title": "Amnesia: A Machine For Pigs",
		"rating": "10/10",
		"image": "https://i.imgur.com/9aAbtG6.jpg",
		"review": "This game took the entirety of the first game, and gave it a pile of steroids. It's a REALLY great story that captivates you with suspense, and doesn't rely too heavily on jump scares, while maintaining the horror theme. the graphics are multitudes better from the first game as well. I'm not ONLY comparing this game to the first, and overall the game is incredible to play all on its own. Even if you havent played the first game, this game can, and does stand out by itself. I feel like it's an honest work of art. I HIGHLY recommend this game."
	},
	{
		"title": "Amnesia: Rebirth",
		"rating": "7/10",
		"image": "https://i.imgur.com/igBhud2.jpg",
		"review": "Pretty solid 3rd game in the Amnesia trilogy, but I definitely think the ending could be better. It had a solid story line, some weird game mechanics, but reality also tied in pretty well with the surreal in the game. From warping to other dimensions, to giant other-worldly machines, it captivated me the whole time. The ending left a bit to be desired, which is why it was given the score that it got, but everyhting leading up to it was fantastic."
	},
	{
		"title": "Call Of Cthulhu",
		"rating": "7/10",
		"image": "https://i.imgur.com/SLvGAb3.jpg",
		"review": "Very nice visually, and the story was actually not bad at all. The choices that you can make actually arent that intuitive at all, and they dont really mean much as you can choose what ending you want between A and B at the very end of the game anyway. There is one alternate ending if you do something specific, but after watching it, I don't see that ending being worth the trouble you'd be going through just to get it. Still a fun game, but it deserves NO higher than a 7, strictly based on how linear and actually kind of boring it was. Still fun at some parts as well as a bit of a mind bender, but nothing too special. "
	},
	{
		"title": "Misao",
		"rating": "6/10",
		"image": "https://i.imgur.com/gKlBRNH.jpg",
		"review": "Pretty basic puzzle/RPG maker game, but it was pretty fun overall. I wouldnt play it again, but the time I spent playing it was actually not bad at all. Ghosts, jump scares, stupid no reason deaths left and right, but after the first few it stopped being amusing, and became repetitive and annoying.   "
	},
	{
		"title": "Far Cry",
		"rating": "Shitty/10",
		"image": "https://i.imgur.com/eKdDCe5.png",
		"review": "Shit sucked tbh. Bad graphics, bad gameplay, no story, stupid glitches.. the whole 9 yards. Just REALLY hard to enjoy at all. Couldn't even make it through the whole game."
	},
	{
		"title": "Far Cry 3",
		"rating": "10/10",
		"image": "https://i.imgur.com/PdptSZG.jpg",
		"review": "LITERALLY THE BEST GAME ON THE PLANET. Awesome graphics, AMAZING story, really unique twists and turns all throughout the entire story, people you care about being ripped away from you, destroying drug cartels, killing terrorists driving like a maniac, blowing up weapon caches, and trying your best to save your friends. The endings, no matter what final choice you make, actually carries weight to the ending. Both of which are actual twist endings and they catch you totally by surprise. I love this game a lot. I want everyone I know to play this game. Do it. If not for me, for the devs that made an amazing game."
	},
	{
		"title": "Far Cry 3 Blood Dragon",
		"rating": "8/10",
		"image": "https://i.imgur.com/GJhk6XD.jpg",
		"review": "The embodiment of 80'd bad-ass all wrapped up in the best game engine from the coolest creators at the time. The whole story is awesome and full of 80's cliche, as well as visually stunning. Bright lights, bad-ass names, Laser dragons, middle fingers and a whole lot of attitude. I really love this game as a one-off. It's a ton of fun and tells an actually pretty in depth story considering how the game was built around nostalgia and the need to kick ass."
	},
	{
		"title": "Far Cry Primal",
		"rating": "5.5/10",
		"image": "https://i.imgur.com/OeCY3nF.jpg",
		"review": "Ooga booga make rock-stick, hit rock stick on big cat head. Nah but in honesty this game was pretty alright. Not the worst Far Cry game, but the story was pretty lame and the only cool thing was riding the animals. The collection system was kinda shit, and the story was very mediocre. The made up language, and the different factions were cool, but it wasn't super intriguing or anything."
	},
	{
		"title": "Far Cry 5",
		"rating": "10/10",
		"image": "https://i.imgur.com/qD6OrSk.jpg",
		"review": "What a crazy, CRAZY time. The story was phenominal. The characters and the relationships between all of the antagonists were so well put together, I couldn't help but fall in love with the game. The graphics were absolutely stunning, and the vehicle/character handling were amazing, AND the planes/helicopters were a really nice, and much needed polish from Far Cry 4. The map was expansive, there was SO much to do, from finding all of the rare fish and land animals, to raiding bases, and helping your fellow team members escape from the Peggies, it was an experience that I won't soon forget."
	},
	{
		"title": "Far Cry: New Dawn",
		"rating": "6/10",
		"image": "https://i.imgur.com/p83mc2c.jpg",
		"review": "This FC game fell a little short in my eyes. The dynamic of having twins as the antagonists were kind of cool, but ultimately I felt like they were just power-tripping, and not so much manipulative as Vaas, Hoyt, or even Joseph Seed from previous games respectively. Being a sequel to FC5, I feel like it didnt really add anything to the main story, just seemed like it was a bit of a rehash, but later on after the fallout. Joseph coming back into the game with his son (who was an ass), was kind of a neat touch and the game was only good from then on, seeing as Joseph's character was such an asset to the 5th game, seeing him again was a really nice inclusion into this game. All in all, I think it was fun and they had some good concepts, but I'm definitely looking forward to the next game, and I probably wont replay this one."
	},
	{
		"title": "Blair Witch",
		"rating": "9.5/10",
		"image": "https://i.imgur.com/RpAstkK.jpg",
		"review": "Man, the mind-bending in this game was unreal. The way the game threw your psyche around the room while you were playing it was just so well done. Your character breaking down faster and faster as the game progresses, as well as actual reactions from the character in-game was astounding. The visuals were very VERY well done and the game didn't rely entirely on cheap jump-scares, although there were a few. In saying that, the story and the enemies you encounter were really well designed and the ending of the game was, to my surprise for a horror game, very well done. I'd recommend this any time for a good time-killer horror game."
	},
	{
		"title": "Super Paper Mario",
		"rating": "6.5/10",
		"image": "https://i.imgur.com/yjQNc0t.jpg",
		"review": "Classic Mario! The Mario games have always appealed to me. They always have this charm to them that no other game can truly encapsulate. Super Paper Mario is no exception. It made me so happy to play this, honestly. The pixls, the flip side, the fighting being a little off of the rails and stepping away from the turn based RPG style fights, the whole 9 yards. The bosses were super unique and well thought out, also. The story, good god, it was heart-wrenching. Watching the story unfold around the gameplay felt a little cheesey at times, but the amount of love and passion that went into the game is definitely noticable. I would definitely play this game again if I had the time. Graphics were super nice as well! the biggest problem I have with the game would have to be the total overall length of the game, and all of the collectables and recipes that you have to find to complete it. Everything else though was very fun to play!"
	},
	{
		"title": "Alan Wake",
		"rating": "9/10",
		"image": "https://i.imgur.com/9Uvz2aY.jpg",
		"review": "What a wild ride this game was. Mental illness, depression, anxiety, fear of the dark, the list keeps going. The overall vibe is incredibly dark, but it was actually super thrilling to play through. Not a whole lot to say, aside from just play this game. Any details I give you might spoil it, so I would just highly recommend that you play it."
	},
	{
		"title": "Bioshock",
		"rating": "7/10",
		"image": "https://i.imgur.com/WfNK1Fg.jpg",
		"review": ""
	},
	{
		"title": "Lucius",
		"rating": "8.5/10",
		"image": "https://i.imgur.com/tfhOKas.png",
		"review": ""
	},
	{
		"title": "Undertale",
		"rating": "4.5/10",
		"image": "https://i.imgur.com/gJVm8u9.jpg",
		"review": ""
	},
	{
		"title": "Tomb Raider",
		"rating": "6/10",
		"image": "https://i.imgur.com/fcExVtb.jpg",
		"review": ""
	},
	{
		"title": "OneShot",
		"rating": "10/10",
		"image": "https://i.imgur.com/v4kMoWs.png",
		"review": ""
	},
	{
		"title": "OneShot: Solstice",
		"rating": "7.5/10",
		"image": "https://i.imgur.com/ottCyQ6.jpg",
		"review": ""
	},
	{
		"title": "Celeste",
		"rating": "9/10",
		"image": "https://i.imgur.com/xGBqkcu.jpg",
		"review": ""
	},
	{
		"title": "Visage",
		"rating": "9.5/10",
		"image": "https://i.imgur.com/GyjX885.jpg",
		"review": ""
	},
	{
		"title": "The Cat Lady",
		"rating": "8/10",
		"image": "https://i.imgur.com/hiZRvpb.jpg",
		"review": ""
	},
	{
		"title": "Downfall",
		"rating": "7.5/10",
		"image": "https://i.imgur.com/6WYKFUu.png",
		"review": ""
	},
	{
		"title": "Lorelai",
		"rating": "8.5/10",
		"image": "https://i.imgur.com/icaBXs6.jpg",
		"review": ""
	},
	{
		"title": "Devil May Cry 1",
		"rating": "6/10",
		"image": "https://i.imgur.com/evpFIiJ.jpg",
		"review": ""
	},
	{
		"title": "Devil May Cry 2",
		"rating": "3/10",
		"image": "https://i.imgur.com/zZCImfw.jpg",
		"review": ""
	},
	{
		"title": "Devil May Cry 3",
		"rating": "5.5/10",
		"image": "https://i.imgur.com/NaJTVqt.jpg",
		"review": ""
	},
	{
		"title": "Devil May Cry 4",
		"rating": "7.5/10",
		"image": "https://i.imgur.com/QRJDsNy.jpg",
		"review": ""
	},
	{
		"title": "DmC Devil May Cry",
		"rating": "9/10",
		"image": "https://i.imgur.com/J0c4ngc.png",
		"review": "Charisma? Oh you mean DmC. Absolute bombshell of a game. Graphics were on point, the combat was amazing, it was challenging to a point that you forgot you were in a storyline, grind out a boss for like 45 minutes, beat him, lower your heart’s bpm from 800, and carry on the story, and the flash backs to the backstory was incredible to watch. The weapon switching was a really nice touch, including the tether, axe and scythe mechanics, and how they worked together to a degree. I fell in love with this game almost immediately, and I’m kind of disappointed that I played it first in the series, not knowing that the order actually mattered. Still a fantastic game, though. I couldn’t quite call it perfect, due to some bugs/crashing/render issues etc. so I think the strong 9/10 holds its ground."
	},
	{
		"title": "Devil May Cry 5",
		"rating": "10/10",
		"image": "https://i.imgur.com/aQq6fGg.jpg",
		"review": "One of the best games of our time. The game itself had so many nods to older DMC gameplay, but also had a TON of new-age features and incredible graphics/cutscenes. The character building and relationships the characters make between eachother is super unique, and the new menu in the bus is super charismatic. The boss fights were intuitive, the controls were buttery smooth, and it was really fun actually building a combo up just to smash enemies even harder. Such a masterpiece and I love it so so much."
	},
	{
		"title": "Strider",
		"rating": "4.5/10",
		"image": "https://i.imgur.com/rLGDbGy.jpg",
		"review": ""
	},
	{
		"title": "To The Moon",
		"rating": "8.5/10",
		"image": "https://i.imgur.com/mKp4uRT.jpg",
		"review": ""
	},
	{
		"title": "Ori And The Blind Forest",
		"rating": "10/10",
		"image": "https://i.imgur.com/GPRps0C.jpg",
		"review": ""
	},
	{
		"title": "Portal",
		"rating": "6/10",
		"image": "https://i.imgur.com/lTF44D3.jpg",
		"review": ""
	},
	{
		"title": "Portal 2",
		"rating": "10/10",
		"image": "https://i.imgur.com/0PHN9Ob.jpg",
		"review": ""
	},
	{
		"title": "Dead Space",
		"rating": "8.5/10",
		"image": "https://i.imgur.com/sBrJ2Ww.jpg",
		"review": ""
	},
	{
		"title": "Dead Space 2",
		"rating": "7.5/10",
		"image": "https://i.imgur.com/jWzZ68e.jpg",
		"review": ""
	},
	{
		"title": "Resident Evil 7",
		"rating": "7/10",
		"image": "https://i.imgur.com/fBRI5nJ.jpg",
		"review": ""
	},
	{
		"title": "Mad Father",
		"rating": "9/10",
		"image": "https://i.imgur.com/Z1TyXZm.jpg",
		"review": ""
	},
	{
		"title": "The Crooked Man",
		"rating": "8/10",
		"image": "https://i.imgur.com/EQFNExB.jpg",
		"review": ""
	},
	{
		"title": "Ib",
		"rating": "7/10",
		"image": "https://i.imgur.com/Xa6LuTQ.jpg",
		"review": "This was actually a blast! I really liked playing through this game and I had a lot of fun doing it. Granted, the graphics were all RPG maker, that didn't stop the story or the spooky vibe from emanating full force through this game. Being in a museum at night, on its own, sounds scary. Adding the elements that this character finds and comes across, would make it an absolute nightmare. The puzzles were incredibly intuitive, and make the game challenging, but without stopping the flow and progression of the game. Super SUPER fun to play through and I would do it again in a heartbeat. I guess the reason that I didn't give it a higher score was the pacing, the graphics (albeit it doesn't take good graphics to make a good game, but it definitely helps) and the fact that I feel like it might have dragged a bit of ass coming to the ending, that waaaasn't all that interesting, and a little cliché. That aside, it was incredibly fun and I look forward to playing it for a second time."
	},
	{
		"title": "Outlast",
		"rating": "8/10",
		"image": "https://i.imgur.com/QQac0kh.jpg",
		"review": "Imagine you are in an asylum. Now imagine in said asylum, all the patients were abused and forced to go through medical testing that was completely involuntary. How would you feel being in the middle of that? This game captures that and adds suspense and horror to something that is already scary. Running through this place that has a million and one hiding spots and all you have is a camera to record all of the things that are going on, with no way to retaliate or fight back. Giants with long chains wrapped around their body chasing you around, skinny zombie-like creatures in the sewers that their soul purpose is to take you down. Everything in this game makes you think twice about everything you do. “Will this door trigger something?”, “Is there someone waiting to jump me in the next room?” and keeps you on your toes the entire game. I really enjoyed the aesthetic of the game, as well. Something about that kind of setting is really unsettling especially when you are totally unarmed. I think it’s only downfall was the ending, really. I have been told though that the DLC is what wraps it all together and ends the story better. I mean I get that, but at the same time, it shouldn't take a DLC or a “Second try” to make up for the ending. All in all though, pound for pound this game is a classic, and chances are, people will be playing it for a long time."
	},
	{
		"title": "Outlast 2",
		"rating": "2/10",
		"image": "https://i.imgur.com/9hPuS5G.jpg",
		"review": "If I said that this game had any redeeming qualities, I would be lying straight to your face, and that's not what I'm all about. This game was absolutely horrendous. Literally the worst horror game I've ever played. Lack of depth, lack of character development, and I feel like the whole game's story line was written by 4 separate people that had never read the other people's scripts. All in all the ONLY thing that I can say was good, were the graphics and the design for the spooky characters. That. Was. It. Nothing else about this game was good, even remotely. I do NOT recommend this game, unless you want to waste 3 hours and you want to try and follow several different paths of a story line that don't lead anywhere."
	},
	{
		"title": "IMSCARED",
		"rating": "6/10",
		"image": "https://i.imgur.com/Z9kgsw4.jpg",
		"review": " It has been a while since I've played this game, but from I remember of it, it had a creepy, old-school vibe about it. The puzzles were interesting, and the graphics/visuals were actually pretty nice compared to some games that I've played. It was interesting, but what really took me out of the immersion was the voice acting. Incredibly loud voiceovers that sounded like they were recorded in the bathroom of a tiny airplane during a thunderstorm. That being said, the game played well, it had cool concepts and ideas, but I wouldn't play it again, strictly because of the voice work."
	},
	{
		"title": "SOMA",
		"rating": "9.5/10",
		"image": "https://i.imgur.com/FrNngBY.jpg",
		"review": "Terrifying. The underwater atmosphere, and the sense of being totally trapped and isolated is something I never want to feel again. That being said, this game did an astounding job at capturing that feeling. Whether it be while you're walking on the ocean floor, watching big shadowy sea creatures pass by, or just being trapped in what can only be described as a tuna can stuffed with alien looking creatures at the bottom of the ocean. Incredible game, incredible atmosphere, and the only downside to it was the ending was a bit of a letdown. Don't let that be the deciding factor on whether or not you play it though. It's worth it overall."
	},
	{
		"title": "Mark After Dark",
		"rating": "9/10",
		"image": "https://i.imgur.com/ufsIadG.png",
		"review": "Although I don't think I made it all the way through this game, this is what I feel an accurate representation of Mark's life would play like. Knowing the main character in real life, I can vouch for this game and say that there are a lot of small things that it picked up, and executed VERY well."
	},
	{
		"title": "Blank Dream",
		"rating": "9/10",
		"image": "https://i.imgur.com/TUH7Xac.jpg",
		"review": "This is an incredible use of the RPG maker template. The graphics were well used, and the story line was in-depth and actually had substance. The use of mirrors throughout the game actually gave you a sense of immersion, almost as if you WERE the character, and you were looking into your own reflection when you stood in front of them. The story line itself was absolutely incredible and actually felt good to complete. The reason I gave it such a high score is because the game played so well. The jump scares were good, the music fit the scenery, and ultimately the whole game had a really sweet message to take away from it at the end. I would happily play this again."
	},
	{
		"title": "Desert Ride Coaster",
		"rating": "Vomit/10",
		"image": "https://i.imgur.com/p532K8L.jpg",
		"review": "45 seconds of nauseating movements and that stomach flipping feeling that you get while you are on a roller coaster. You can hit the “GO” button as many times as you want, but about halfway through I had to take it off because I was legitimately going to vomit. Highly recommend to people that hate themselves, or just enjoy puking."
	},
	{
		"title": "The Visitor",
		"rating": "Spooky/10",
		"image": "https://i.imgur.com/djXd1Bi.jpg",
		"review": "The game was a dollar for a reason. You don’t move, you lay in bed and spooky creatures jump out at you and make the lights flicker. Kind of a fun VR experience, and for the money, you get a couple jumps out of it."
	},
	{
		"title": "Rick and Morty Virtual Rickality",
		"rating": "8/10",
		"image": "https://i.imgur.com/V03sLQm.jpg",
		"review": "This game was a riot. You feel like you are actually in Rick’s garage. From playing Troy, to doing the laundry, it is an experience in itself. Getting to be face to face with Rick and Morty, playing with the gadgets rick has created, feeding the monster under the floor (great object permanence btw) and basically doing meaningless garbage for rick is somehow fun, not sarcastically. I would recommend this game to anyone that fits 2 categories. “Has a VR headset” and “Likes Rick and Morty”. Couldn’t give it a 10 though, due to how short the game itself was. I want it to be at least like.. A few hours? Maybe more? I think in all it took me like 2 hours, taking in the scenery and fumbling around. If you were to have seen the game played, then played it yourself, you would beat it in 45 minutes tops. Good game overall though. Well deserved rating."
	},
	{
		"title": "Paranormal Activity: The Lost Soul",
		"rating": "5/10",
		"image": "https://i.imgur.com/R58D7tx.jpg",
		"review": "PA:LTS played into the biggest thing it could. Immersing you into this terrifying hellscape of a mansion. Walk up to a house and carnage ensues. Children scare you, paintings scare you, book shelves scare you, literally nothing is safe. I think I was scared by a candle at one point. The “story” is kind of all over the place, but at the same time I feel that it’s main goal was to just scare the Jesus into you. Yes, into you. Floors falling away, giant smoke creatures, hidden entrances, this game has it all. The reason it got the rating it did, is because it had no real depth. It  was just trying (and succeeding) to be scary, but not much else. Collect items, avoid monsters, get scared, cry, and get to the end. At the end of the game I didn't feel like I accomplished much, and that I just ran through a house getting scared. I’d recommend this to family and friends, as long as I could watch them play it."
	},
	{
		"title": "South Park The Stick Of Truth",
		"rating": "6.5/10",
		"image": "https://i.imgur.com/l3oJftR.jpg",
		"review": "Absolute hilarity. This game was clever, immature, disturbing, offensive, and extremely fun. Exactly what you would expect from the creators and writers of South Park. They find a way to make extremely touchy subjects (abortion, Nazis, racism) into somehow palatable commercial comedy. It's full of references from the shows, which was incredibly neat to see, and being able to interact with characters you know and love from the show is a really cool feeling, having watched the show since I was young. The combat style is very RPG based and it’s incredibly creative when it comes to abilities. Using farts as attacks is something literally only this game could get away with. Fun game, but get ready for about 25-30 hours of gameplay. Pretty long and unfortunately can't finish it in one sitting, unless you're a machine."
	},
	{
		"title": "The Witch's House",
		"rating": "6/10",
		"image": "https://i.imgur.com/tcWe4oN.jpg",
		"review": "RPG maker games aren't typically the best at telling a story, but this one had a really nice tone to it. Pretty generic type story, but the puzzles and characters were pretty loveable. The multiple endings were very neat also. The “good” or alternate ending is incredibly mind blowing. It explains the story SO well, as well as warping your mindset of every RPG game you play afterwards. Without giving anything away, not everything is how it seems. If you play this game, I highly recommend playing all of the endings. Just make sure you save before the last chunk of the game, in a save slot that you won't accidentally save over it!"
	},
	{
		"title": "Spooky's Jump Scare Mansion",
		"rating": "5/10",
		"image": "https://i.imgur.com/RaaAeMf.png",
		"review": "Well the game stayed true to its name. Jumpscares, randomly generated hallways, bosses that freak you out, the whole 9 yards. Being a 2D game and holding up rating-wise is pretty tough, let alone in the horror genre. It played well and had a lot of good aspects to it. The Easter eggs were a pretty nice touch too. All-in-all it was an okay game. As cool as it was, it got old pretty quick and by room 600 I just wanted the game to be over, which was a huge turn off, almost “expecting” the outcomes of getting to a specific numbered room. “Oh it's room 250, there should be a boss any second now” is not the type of anticipation a horror game should have, nor should it feel like it's dragging out way too long. Fun stream game, though I don't think I'd ever play through it again."
	},
	{
		"title": "Dark Souls",
		"rating": "7.5/10",
		"image": "https://i.imgur.com/wSkxKsx.jpg",
		"review": "So we’re here, hey? Alright. Dark Souls. I died.. sooooo many times. It was incredibly frustrating. All the time. Let me tell you though, the feeling of FINALLY beating those really difficult bosses? That last swing of your sword, watching the boss fall to the ground and the souls going into your inventory/counter is more satisfying than the 1 hour “most satisfying videos in the world” compilations on YouTube. There wasn't a whole ton of story to it, mainly just strategic hack and slash but your highs are high and your lows are so unbelievably low. You just hate everything when you die but that sweet victory sound is so worth it. The ambient sense of “please don't see me” as well as the very pleasing landscapes and structures are such a cool aspect of the game. I'd recommend it to anyone that wouldn't break a controller when they are frustrated."
	},
	{
		"title": "Detention",
		"rating": "7/10",
		"image": "https://i.imgur.com/uGEgVY0.jpg",
		"review": "Boy, this game. MAN this game was good. Side scrolling puzzle filled madness set with a very dark tone. It was incredibly gripping. I didn't want to stop playing the game. You become pretty gripped in the story and invested in the characters. The reason it was given a 7/10 is because of the ending I was given. It didn't close the game out too well in my opinion. Left you hanging a bit, but that is how the game was built and I couldn't knock very many points off for that. There are other endings, and the fact that I was too lazy to replay the game to get a different ending wasn't the game’s fault in all fairness. The art style was incredibly unique though. Kept your attention at all times. Very neat concepts and design to the enemies and puzzles though. Would recommend to anyone who likes puzzle/horror/indie games."
	},
	{
		"title": "Valley",
		"rating": "8/10",
		"image": "https://i.imgur.com/Y2MvxYk.jpg",
		"review": "I absolutely loved this game. The gameplay was literally flawless. The graphics were so aesthetically pleasing. Looking at the landscapes were stunning, the voice acting was VERY suiting to the characters, and the story line did not disappoint. It was very unique in its tasks/quests and it fit the demeanor of the overworld. I really wish this game could have gotten a higher score but it did feel a little bit forced towards the end, and the ending itself left me with a million questions. I REALLY want a second game. I need it to follow up on some key story aspects that I would love to have explained. Good game though, overall. Would recommend to anyone."
	},
	{
		"title": "Tomato Way",
		"rating": "100/10",
		"image": "https://i.imgur.com/DZEbY6C.jpg",
		"review": "Where to even begin? Beautiful graphics, flawless character control, voice acting was incredible, and there's nothing I would change about this game. If you thought this wasn't sarcasm, play the game yourself. Please"
	},
	{
		"title": "A Story About My Uncle",
		"rating": "9/10",
		"image": "https://i.imgur.com/DSH6ny9.jpg",
		"review": "Honestly, this game is absolutely beautiful. Sets an amazing atmosphere, has you encapsulated in this other-worldly vibe, and has a main goal that you're always working towards. The gameplay, graphics, and the feeling of the game itself was honestly amazing. If you haven't played this game, I highly recommend it. There isnt much for actual combat or anything, but sitting back and relaxing while working through spacial-relation type puzzles is (at least to me) one of the coolest part about finishing games. Getting to enjoy the little things in them, and stopping to take a look at the world that the devs have built for you to enjoy. The ONLY reason this game got a 9, was that it wasn't super long, and the story was very fleshed out and right in front of you all the time, with no real unexpected twists or surprises. Still, all in all an amazing game. "
	},
	{
		"title": "Dead Effect",
		"rating": "1.5/10",
		"image": "https://imgur.com/u84K4eE.jpg",
		"review": "Whew, this was a DOOZIE. I.. didn't really find much about this game appealing. the voice acting was really bad, the volumes and sound mix down were out of whack entirely, The enemies were all basically the exact same.. The list goes on. The original DOOM had more diversity in characters/enemies. I recommend this, only if you wanna have a chuckle, and its on sale on Steam. Otherwise, pass on this game any chance you get."
	},
	{
		"title": "Dead Effect 2",
		"rating": "2/10",
		"image": "https://i.imgur.com/fawlQmW.jpg",
		"review": "I wanted this game to be good so badly. Much like the first one, it was just non-stop fighting, with the occasional break for long and drawn out lore from an NPC type character with no real notible attributes aside from the function they served. IE: Shop for gear, shop for weapons, shop to spend XP points. The dialogue from the main woman who's name I can't recall, was a droning mess that had me almost immediately disinterested. Fight to get through the game, fight the shitty game mechanics themselves, and die a whole lot. LOOOTS of dying to stupid mechanics. The suicide bomber zombie that runs up behind you and gives you no warning, audio or visul, that he's running up behind you and is about to explode in a 30x30 foot radius. Dosjointed gameplay, poorly written story/dialogue, and the bossfight was next to infuriating, due to you NEEDING to be kitted out to fight him, but were given no warnings or anything to actually gear out. It just seemed like a standard mission, which I typically used a bow and Katana, but the boss started flying, and the bow did next to no damage, while the Katana did literally nothing as it couldn't reach him. Please avoid this series if at all possible. It's god awful."
	},
	{
		"title": "Katana ZERO",
		"rating": "9.5/10",
		"image": "https://i.imgur.com/c3jGmDy.jpg",
		"review": "NOW THIS IS A GAME! Action? Check. Deep and thoughtful storyline, with suspence, choices, and twists? Double check. Holy-shit-I'm-a-total-badass-ninja-guy? You best believe that box is CHECKED. This game was so unbelievably amazing. the story is really deep rooted into coping with depression and mortality, while balancing being a total badass samurai on top of that. If you dont feel like a god, and equally emotional after plaing this game, You are a husk of a human and you need to see a shrink. I typically don't get this hype about games, but this one is a total instant classic for me, and I hope I can play it again soon."
	},
	{
		"title": "Code Vein",
		"rating": "6.5/10",
		"image": "https://i.imgur.com/FHtZthj.jpg",
		"review": ""
	},
	{
		"title": "Bioshock: Infinite",
		"rating": "8/10",
		"image": "https://i.imgur.com/EG4Woql.jpg",
		"review": ""
	},
	{
		"title": "Pembrey",
		"rating": "4.5/10",
		"image": "https://i.imgur.com/wFb57aL.jpg",
		"review": ""
	},
	{
		"title": "Devotion",
		"rating": "10/10",
		"image": "https://i.imgur.com/nVETXFp.jpg",
		"review": ""
	},
	{
		"title": "Layers Of Fear",
		"rating": "4/10",
		"image": "https://i.imgur.com/vZygOU7.png",
		"review": ""
	},
	{
		"title": "Layers Of Fear 2",
		"rating": "3/10",
		"image": "https://i.imgur.com/DANUGlQ.jpg",
		"review": ""
	},
	{
		"title": "Dead Dead Redemption 2",
		"rating": "10/10",
		"image": "https://i.imgur.com/8B1hnoR.jpg",
		"review": ""
	},
	{
		"title": "The Sandman",
		"rating": "5/10",
		"image": "https://i.imgur.com/fRIiGem.jpg",
		"review": "Super cute game! Has lots of charm to it, the story and small twist within it is actually super sweet, and the whole scope of this game was a total mind bend, but I loved it. The Sandman himself is frightening yet adorable, the main character is super sweet and innocent, and the gameplay is hilarious. Awesome game at an amazing price."
	},
	{
		"title": "The Forest",
		"rating": "6.5/10",
		"image": "https://i.imgur.com/W8Yp2oi.jpg",
		"review": "This was actually a blast to crash through! No pun intended. insane cannibals, missing child, multiple endings, and much more. the building, hunting and gathering was actually one of the best parts of the game in my eyes and that was super fun to play through. Having insane looking monsters and cannibals flying around the map trying to take your head off was thrilling and it kept you on edge, the whole time you were above ground, and when you are underground? YOUR steps freak you out. Please. Play this game."
	},
	{
		"title": "The Deed",
		"rating": "3.5/10",
		"image": "https://i.imgur.com/XdWuwLM.png",
		"review": "Bland game, only a few ways to play it, but it was fun for about the 15 minutes I could crash my way through it. 8 bit murder mystery, not too much else. Grab it if thts the genre you're into but other than that, I'd pass on it."
	},
	{
		"title": "Doki Doki Literature Club",
		"rating": "4.5/10",
		"image": "https://i.imgur.com/bDPptCu.png",
		"review": "Doki Doki is a very interesting game. At first, I refused to play it, but ended up with it in my Steam library and made it all the way through. They played on the quirks of anime style dating games and twisted it into a pretty moderate suspense/horror-type genre. I liked the art and music as well as the unexpected nature it had. The reason I gave it the rating that I did was due to it having very long and tedious “down-times”. Meaning that it drug on for way too long without really gripping you. It felt like I should just skip through the dialogue and get to the good stuff” which was a very small portion of the game. I would recommend it to anyone who likes the art style and a few hours to kill, but if that isn't the case, I’d just watch it on YouTube while you doze off to sleep or something."
	}, {
		"title": "Brütal Legend",
		"rating": "9.5/10",
		"image": "https://i.imgur.com/r6Az2uv.jpg",
		"review": "Man, this game kicks so much ass. Heavy metal music, bad-ass flames and weapons, tons of collectables, and a huge world to explre, ON TOP of an amazing story of hurt, overcoming adversaries and ultimately teamwork. It's incredible that they got Jack Black as a lead in this game, because it would NOT be the game that it is without him in it."
	},
	{
		"title": "Cyberpunk 2077",
		"rating": "8/10",
		"image": "https://i.imgur.com/XgpJuyl.jpg",
		"review": "In my opinion this game was pretty overhyped, but it was for a good reason. It had an awesome array of sidequests, story missions, and weapons to choose from. There was always something to do in that game whether it be upgrading gear, finding new weapons, or doing missions for that sweet sweet EXP. The campaign portions were filled with lore and backstory, the trials and difficulties of Johnny being around, and it engrossed my entire mindset for quite a while. Now, I'm sure you've heard the million and one complaints about bugs and glitches. I was fortunate enough to only have seen or run into about 3-4 in the entire 50 hours that I was playing. the car phased through a bridge, and some other immersion breaking stuff. I understand that most see that as unacceptable, but the undertaking this game took, how big the game is, and how much time and thought went into the story and dialogue is more than enough to make up for the shortcomings on the devs side of things."
	},
	{
		"title": "Depth 6",
		"rating": "4.5/10",
		"image": "https://i.imgur.com/qteIpJV.jpg",
		"review": "this was a weeeeird one. Traversing caves in almost pitch black sounds terrifying, right? That's because it is. This game tries its best to encapsulate that feeling, but ultimately I feel like it falls a little short. If this idea for a short game were to be developed/published by someone like Bethesda, Red Barrel, or Frictional Games, this would have been more than enough to satiate my horror craving in a bite sized hour to two hour game. Alas, what we were given was a dimly lit, poorly planned game with a few jump-scares, but it was fun at the time. Would I play it again? No. Would I recommend it to anyone else? Probably not."
	},
	{
		"title": "Transference",
		"rating": "6/10",
		"image": "https://i.imgur.com/CHLRbgY.jpg",
		"review": "this game melted my mind in so many ways, I cant even begin to describe it. The reason it got the score that it did, wasnt because the game itself was bad, but because it was.. Unintuitive to say the least. It had a great story, great characters, and a really cool futuristic mind melting concept to back it all up, but I feel as a player, i got lost more often than not. Not becuase it was some difficult puzzle, but becuase something was under a table, or on the other side of a panel no one in their right mind would think to look behind. I guess it kind of adds to the puzzle nature, but I think that, personally, it was added there to draw ou tthe playtime of the game, not to add substance. Other than those shortcomings, the game itself was fantastic and I would recommend it to anyone looking for a spooky Sci-Fi type game."
	},
	{
		"title": "Find Yourself",
		"rating": "9/10",
		"image": "https://i.imgur.com/dMCJh1N.jpg",
		"review": "Now this is what I wish Depth 6 looked like. This game has it all. Demons, creepy subway stations, mannequins, time shifting, mental trauma, you name it, its in there. Not only that but the game is actualyl reletively short, so if you wanted to play it in one sitting on stream, or with a group of friends, it's not going to take days, or countless hours to beat. The look and feel of the game are phenominal. The setting that it places you in mentally and physically are exactly what I would want in a horror game. It's insane to me that big game devs havent adopted most of the things in games like this, because my god, it's incredible. I cannot however give this game a 10, SOLELY because of the fact that the ending is lacklustre. However, do not let that dissuade you from playing the game. It's incredible and I recommend all spooky game lovers play this at least once."
	},
	{
		"title": "Crash Bandicoot",
		"rating": "6.5/10",
		"image": "https://i.imgur.com/p9a4JwA.jpg",
		"review": "It's Crash, man. Although I typically like to play through these games and 100% complete them, I don't really find myself wanting to do that with the Crash series. It scratches the nostalgia itch without a doubt, but I just kinda rammed my way through it, just to see the ending. It was a fun, yet challenging process, but I enjoyed myself the whole time."
	},
	{
		"title": "A Hat In time",
		"rating": "9/10",
		"image": "https://i.imgur.com/6KA2sMG.jpg",
		"review": "While this game had its ups and downs, A Hat In time was the cutest and equally challenging games that I've played. Some backtracking, replaying missions, choices in storylines, and it had me wanting to collect EVERYTHING. It was an absolute riot of a game, and it only took me a couple of streams to play through the whole thing. It was a ton of fun, and I would definitely play through it again with my kids or something some day."
	},
	{
		"title": "Resident Evil 8: The Village",
		"rating": "10/10",
		"image": "https://i.imgur.com/Sg9nxJT.jpg",
		"review": "Man what a sequel. This game had everything you expect out of a Resident Evil title. Crazy shop-keepers, big crazy bosses, and a wicked plot to tie that all together. It felt like it had me guessing on a few occasions, but ultimately it was an amazing experience. The only thing I can knock it for, is for having a hand-held story. Granted, all of the other RE titles are the same, I thought this one would have been different. It had all of the boss levels laid out in a hub-world type area, and I thought you would be able to do the bosses in any order I wanted, and i just so happened to choose the Vampire one first. But no, you have to collect keys from each boss that opens the gate to the next boss. It seemed like I kind of got.. misled a little bit. All of that aside though, this game had action, drama, suspense, and everything else you want out of a game like this. There are horrible looking creatures, and a plot twist for the ages. this game really makes you think about what outcomes could possibly be next. What kind of people you're going to meet, what kind of bosses there will be in the future. It's insane to think about how this story will progress and the cliffhanger they leave you on, implying there will be another installment to go along with this series, is absolutely amazing. I cannot wait for the next release and I'll be all over it once it comes out."
	},
	{
		"title": "Locked Up",
		"rating": "10/10",
		"image": "https://i.imgur.com/KTKDu2X.jpg",
		"review": ""
	}
]
